<?php
/*┌─────────────────────────────────────────────────
  │当前服务器ID  主服：1  备服：2
  │*/	define('SVRID',1);

/*┌─────────────────────────────────────────────────
  │是否有备服，有备服1 无备服0 
  │*/	define('IS2SVR',0);
   
/*┌─────────────────────────────────────────────────
  │主服注册系统域名和端口 比如网站域名是www.abc.com端口是8889 就填www.abc.com:8889，默认80端口不用加:80
  │*/	define('HOST1_DOMAIN','www.zongda66.com'); 
    
/*┌─────────────────────────────────────────────────
  │备服注册系统域名和端口 比如网站域名是www.abc.com端口是8889 就填www.abc.com:8889，默认80端口不用加:80
  │*/	define('HOST2_DOMAIN','www.zongda66.com');

/*┌─────────────────────────────────────────────────
  │如果有两个服务器，两个服务器间的数据多少秒同步一次，默认900秒同步一次
  │*/	define('SYNCTIME',900); 
    
/*┌─────────────────────────────────────────────────
  │主服和备服数据库同步的方式
  │1：为主服程序远程连接备服数据库进行mysql数据库同步，需要备服数据库支持远程连接
  │2：使用curl通讯进行mysql数据库同步，需要主备两个服务器都支持curl函数
  │*/	define('MYSQLSYNCMODE',2); 
/*┌─────────────────────────────────────────────────
  │v93 服务端授权信息，千万别修改，否则数据库可能会被清空
  │*/	define('WEBLIC','3dfad9bd5789a7b6ef6fec93499bfcd9,www.zongda66.com,www2.zongda66.com');
  
        
/*┌──────────────────────────────┐
  │下边四项是主服数据库的设置　　　　　　　　　　　　　　　　　│
  └──────────────────────────────┘*/
	define('MYSQL1HostNameOrIp','localhost');	//主服数据库主机名或IP
	define('MYSQL1UserName','填写数据库用户名');  			//主服数据库用户名
	define('MYSQL1Password','填写数据库密码');	  		//主服数据库密码
	define('MYSQL1DataBaseName','填写数据库用户名');	//主服数据库名 


/*┌──────────────────────────────┐
  │下边四项是备服数据库的设置                              　　│
  └──────────────────────────────┘*/
	define('MYSQL2HostNameOrIp','');	//备服数据库主机名或IP
	define('MYSQL2UserName','填写数据库用户名');  		//备服数据库用户名
	define('MYSQL2Password','填写数据库密码');	  		//备服数据库密码
	define('MYSQL2DataBaseName','填写数据库用户名');	//备服数据库名

  
/*┌─────────────────────────────────────────────────
  │授权的安装路径，请不要修改  /表示网站根目录
  │*/	define('INSTALLPATH','/'); 
 
/*┌─────────────────────────────────────────────────
  │cookie效验钥，安装时随机生成，安装好后请不要修改
  │*/	define('COOKKEY','9yDLt7Jr3Hp9Fn5DdLt7Jr3Hp9Fn5Dl1');
  
/*┌─────────────────────────────────────────────────
  │cookie加解密钥，安装时随机生成，安装好后请不要修改
  │*/	define('COOKKEY2','Bj7Z3Hp9Fn5CKs2Iq8Go4Em2u6Ks2Iq8');

/*┌─────────────────────────────────────────────────
  │算法密钥，请不要修改 
  │		define('MD5KEY','mdgal0bCsZHphzWjDVqSo2Ey9k6QiK85uUvw1fNL47nxXGJrMteTABY3IRcPOF');
  │*/	define('MD5KEY','Bdln4rjGehzPKFRZMkqcf2xUbH8s9uXgiDEV0LN1YwOJAI7T5QmyCpavWS6o3t');

/*┌─────────────────────────────────────────────────
  │通讯密钥，请不要修改，否则数据库可能会被清空
  │		define('HTTPKEY','_VK1eEq2Nv4djf6TaAZBiGhLwRCyWU7gmnO08ctXz95MQsFYHPJxDkpbr3oIuSl|');
  │*/	define('HTTPKEY','_8wzQay7SOnbrGR0p3kvoFcLIX2eNAsmZTVi6x9CWH1fBPD4gUYuJhq5EjtdKMl|');
  
/*┌─────────────────────────────────────────────────
  │KSS服务端授权类型
  │*/	define('LICTYPE',1);
  
/*┌─────────────────────────────────────────────────
  │在分页的情况下每页显示的数据行数
  │*/	define('ZPAGESIZE',30);  
 
/*┌─────────────────────────────────────────────────
  │零售时是否向客户发送订单邮件和发送邮件的方式，0不发送 1本地发送 2远程服务器发送
  │0不发送，本服务器Socket和Curl组件都不支持
  │1本地发送，本服务器PHP必须支持Socket组件
  │2远程服务器发送，本服务器PHP必须支持Curl组件， 需要设置远程发送邮件的服务器接口地址
  │远程发送时 
  │*/	define('SENDMAILMODE',0); 

/*┌─────────────────────────────────────────────────
  │远程发送邮件的服务器接口地址 
  │*/	define('REMOTESENDMAILAPI','http://***/kss_inc/mailapi.php'); 
 
/*┌─────────────────────────────────────────────────
  │用户接收备份数据库的邮箱
  │*/	define('QQMAIL2','浣犵殑QQ鍙稝qq.com'); 
  
/*┌─────────────────────────────────────────────────
  │用户发送系统邮件的QQ邮箱名
  │*/	define('QQMAIL','浣犵殑QQ鍙稝qq.com');  
   
/*┌─────────────────────────────────────────────────
  │用户发送系统邮件的QQ邮箱的密码
  │*/	define('QQMAILPASSWORD',''); 

/*┌─────────────────────────────────────────────────
  │自动备份方式，0:不自动备份  1:只自动备份到kss_logs/databak目录  2:自动备份到kss_logs/databak目录并发送到QQ邮箱
  │设置为2时需Socket和Curl支持
  │*/	define('BAKDATAMODE',1);
      
/*┌─────────────────────────────────────────────────
  │自动备份数据库发送到QQ邮箱时，备份文件分卷大小（单位KB），默认为200KB（太大很多服务器会产生30秒超时）
  │*/	define('BINSIZE',200);
      
/*┌─────────────────────────────────────────────────
  │安全接口密码，以标准MD5加密存放
  │*/	define('MYSQLBAKPASSWORD','d94354ac9cf3024f57409bd74eec6b4c'); 
    
/*┌─────────────────────────────────────────────────
  │网站域名的备案号
  │*/	define('ICPNUM','*ICP备******号');    
  
/*┌─────────────────────────────────────────────────
  │售卡页面防第三方调用cook认证，开启请填1
  │*/	define('SALECOOK',0);   
  
/*┌─────────────────────────────────────────────────
  │v91 服务端唯一ID，请不要修改，否则可能不能正常升级服务端
  │*/	define('WEBID','+=='); 
  
/*┌─────────────────────────────────────────────────
  │v91 是否启用RSA安全通讯，服务端存放私钥，客户端存放公钥
  │*/	define('RSACRYPT',0); 
  
/*┌─────────────────────────────────────────────────
  │v91 RSA私钥
  │*/	define('RSA_PRVKEY',''); 
  
/*┌─────────────────────────────────────────────────
  │v91 RSA模数
  │*/	define('RSA_MODULES',''); 
  
/*┌─────────────────────────────────────────────────
  │v91 网站名
  │*/	define('ADMINWEBNAME','网络用户管理系统'); 
  
/*┌─────────────────────────────────────────────────
  │v91 语言包
  │*/	define('LANGPACK','GB2312');
  
/*┌─────────────────────────────────────────────────
  │v91 机器码中有多少字段信息相符就认为机器码未变动，机器码格式= 字段1,字段2,...,字段n 不同字段以逗号分隔
  │*/	define('PCCODENUM',1); 
  

/*┌─────────────────────────────────────────────────
  │v93 机器码按阈值判断后，是否保留旧的机器码，1为保留 0为不保留
  │*/	define('PCCODEJOIN',0); 
  
/*┌─────────────────────────────────────────────────
  │v93 选择软件模式，1为不轮什么操作都要重新选择软件，2为选择了软件后所有操作都针对该软件，除非切换软件
  │*/	define('SELSOFTMODE',1);
  
/*┌─────────────────────────────────────────────────
  │v93 服务端登记授权信息
  │*/	define('PRV_SVRLIC',''); 
      
/*┌─────────────────────────────────────────────────
  │系统保留参数，请不要修改
  │*/	define('HTTP_USER_AGENT',';'); 

/*┌─────────────────────────────────────────────────
  │登陆安全，限定IP模式
  │*/	define('BINDIP',1); 

/*┌─────────────────────────────────────────────────
  │网站首页跳转到的URL
  │*/	define('HOMEPAGEGOTO','./kss_admin/index.php'); 
      
/*┌─────────────────────────────────────────────────
  │会员验证日志保留天数
  │*/	define('Z_LOG_DAY',2);  
      
/*┌─────────────────────────────────────────────────
  │登陆后台强制使用中文密码为1 否则为0
  │*/	define('CHINESEPASSWORD',0); 
        
/*┌─────────────────────────────────────────────────
  │充值或购卡时是否保留最近日志，1为保存 0为不保存。充值和购卡没问题的话建议用0
  │*/	define('DEBUGPAYWG',1);
          
/*┌─────────────────────────────────────────────────
  │不用更改此值，系统自动修正
  │*/	define('ADMINFOLDER','kss_admin');   
           
/*┌─────────────────────────────────────────────────
  │异常系统锁多少秒后自动清除，系统关键参数，如果你不清楚请别修改
  │*/	define('AUTODELLOCK',60);  
            
/*┌─────────────────────────────────────────────────
  │是否将运行时错误信息输出 3为输出并记录到日志 2只记录日志 1只输出  0为不记录也不输出 建议设置为2
  │*/	define('PHPERROUPUT',3);   

/*┌─────────────────────────────────────────────────
  │对帐方式，0:异步  1:同步  系统保留参数，请不要修改
  │*/	define('WGDATA',0);    
  
 
/*扩展升级接口，此行禁止删除*/
?>